## IS 362 – Project 3
### By: Kimesha Josephs

Your assignment involves combining information from a number of SQL tables, then displaying the information in a pandas DataFrame. For your relational database management system, you may use any RDBMS, including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by the database in Step 1 below.

1. For your database, you should download and install the appropriate version of the Chinook database for your RDBMS, which is available here, under the downloads tab: https://chinookdatabase.codeplex.com/

2. Your task is to create a pandas DataFrame that displays Customers’ Last Name and First Name, and each customer’s purchased Track names and Album Titles. The information should be sorted by Customer LastName then Customer FirstName.

In [5]:
import pandas as pd
import sqlalchemy as sqla
from sqlalchemy import create_engine

Create a connection to MySql.

In [8]:
engine = sqla.create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw="Lilkim21",
                               db="chinook"))

Create a query to join the tables

In [16]:
sql_query = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title
         FROM Customer
         LEFT JOIN Invoice
         ON Customer.CustomerId = Invoice.CustomerId
         LEFT JOIN InvoiceLine
         ON Invoice.InvoiceId = InvoiceLine.InvoiceId
         LEFT JOIN Track
         ON InvoiceLine.TrackId = Track.TrackId
         LEFT JOIN Album
         ON Track.AlbumId = Album.AlbumId
         ORDER BY Customer.LastName, Customer.FirstName'''

Read data into pandas dataframe.

In [17]:
pd.read_sql(sql_query, engine).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas